<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [1]:
!pip install sqlalchemy==1.3.9

Defaulting to user installation because normal site-packages is not writeable
Collecting sqlalchemy==1.3.9
  Using cached sqlalchemy-1.3.9-cp314-cp314-linux_x86_64.whl
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.45
    Uninstalling SQLAlchemy-2.0.45:
      Successfully uninstalled SQLAlchemy-2.0.45
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
ipython-sql 0.5.0 requires sqlalchemy>=2.0, but you have sqlalchemy 1.3.9 which is incompatible.
Successfully installed sqlalchemy-1.3.9

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [2]:
!pip install ipython-sql
!pip install ipython-sql prettytable

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: ipython-sql in /home/benni/.local/lib/python3.14/site-packages (0.5.0)
Requirement already satisfied: prettytable in /home/benni/.local/lib/python3.14/site-packages (from ipython-sql) (3.17.0)
Requirement already satisfied: ipython in /usr/lib/python3.14/site-packages (from ipython-sql) (8.37.0)
Collecting sqlalchemy>=2.0 (from ipython-sql)
  Using cached sqlalchemy-2.0.45-cp314-cp314-manylinux2014_x86_64.manylinux_2_17_x86_64.manylinux_2_28_x86_64.whl.metadata (9.5 kB)
Requirement already satisfied: sqlparse in /home/benni/.local/lib/python3.14/site-packages (from ipython-sql) (0.5.4)
Requirement already satisfied: six in /usr/lib/python3.14/site-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in /home/benni/.local/lib/python3.14/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet>=1 in /usr/lib64/python3.14/site-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/lib/python3.14/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.15.0)
Requirement already satisfied: decorator in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (5.2.1)
Requirement already satisfied: jedi>=0.16 in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (3.0.41)
Requirement already satisfied: pygments>=2.4.0 in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (2.19.1)
Requirement already satisfied: stack_data in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: wcwidth in /usr/lib/python3.14/site-packages (from prompt_toolkit<3.1.0,>=3.0.41->ipython->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /usr/lib/python3.14/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.5)
Requirement already satisfied: ptyprocess>=0.5 in /usr/lib/python3.14/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing>=1.2.0 in /usr/lib/python3.14/site-packages (from stack_data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: asttokens>=2.1.0 in /usr/lib/python3.14/site-packages (from stack_data->ipython->ipython-sql) (3.0.0)
Requirement already satisfied: pure_eval in /usr/lib/python3.14/site-packages (from stack_data->ipython->ipython-sql) (0.2.3)
Using cached sqlalchemy-2.0.45-cp314-cp314-manylinux2014_x86_64.manylinux_2_17_x86_64.manylinux_2_28_x86_64.whl (3.3 MB)
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.9
    Uninstalling SQLAlchemy-1.3.9:
      Successfully uninstalled SQLAlchemy-1.3.9
Successfully installed sqlalchemy-2.0.45
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: ipython-sql in /home/benni/.local/lib/python3.14/site-packages (0.5.0)
Requirement already satisfied: prettytable in /home/benni/.local/lib/python3.14/site-packages (3.17.0)
Requirement already satisfied: ipython in /usr/lib/python3.14/site-packages (from ipython-sql) (8.37.0)
Requirement already satisfied: sqlalchemy>=2.0 in /home/benni/.local/lib/python3.14/site-packages (from ipython-sql) (2.0.45)
Requirement already satisfied: sqlparse in /home/benni/.local/lib/python3.14/site-packages (from ipython-sql) (0.5.4)
Requirement already satisfied: six in /usr/lib/python3.14/site-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in /home/benni/.local/lib/python3.14/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: wcwidth in /usr/lib/python3.14/site-packages (from prettytable) (0.2.13)
Requirement already satisfied: greenlet>=1 in /usr/lib64/python3.14/site-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/lib/python3.14/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.15.0)
Requirement already satisfied: decorator in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (5.2.1)
Requirement already satisfied: jedi>=0.16 in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (3.0.41)
Requirement already satisfied: pygments>=2.4.0 in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (2.19.1)
Requirement already satisfied: stack_data in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in /usr/lib/python3.14/site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /usr/lib/python3.14/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.5)
Requirement already satisfied: ptyprocess>=0.5 in /usr/lib/python3.14/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing>=1.2.0 in /usr/lib/python3.14/site-packages (from stack_data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: asttokens>=2.1.0 in /usr/lib/python3.14/site-packages (from stack_data->ipython->ipython-sql) (3.0.0)
Requirement already satisfied: pure_eval in /usr/lib/python3.14/site-packages (from stack_data->ipython->ipython-sql) (0.2.3)

In [3]:
%load_ext sql

In [4]:
import csv, sqlite3
import prettytable
prettytable.DEFAULT = 'DEFAULT'

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [5]:
!pip install -q pandas

In [6]:
%sql sqlite:///my_data1.db

In [7]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date               101 non-null    object
 1   Time (UTC)         101 non-null    object
 2   Booster_Version    101 non-null    object
 3   Launch_Site        101 non-null    object
 4   Payload            101 non-null    object
 5   PAYLOAD_MASS__KG_  101 non-null    int64
 6   Orbit              101 non-null    object
 7   Customer           101 non-null    object
 8   Mission_Outcome    101 non-null    object
 9   Landing_Outcome    101 non-null    object
dtypes: int64(1), object(9)
memory usage: 8.0+ KB

**Note:This below code is added to remove blank rows from table**

In [8]:
#DROP THE TABLE IF EXISTS

%sql DROP TABLE IF EXISTS SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[]

In [10]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
(sqlite3.OperationalError) table SPACEXTABLE already exists
[SQL: create table SPACEXTABLE as select * from SPACEXTBL where Date is not null]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [11]:
querry = "select DISTINCT Launch_Site from SPACEXTBL;"
pd.read_sql_query(querry, con)

    Launch_Site
0   CCAFS LC-40
1   VAFB SLC-4E
2    KSC LC-39A
3  CCAFS SLC-40


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [12]:
querry = "select Launch_Site from SPACEXTBL WHERE Launch_Site LIKE '%CCA%' LIMIT 5;"
pd.read_sql_query(querry, con)

   Launch_Site
0  CCAFS LC-40
1  CCAFS LC-40
2  CCAFS LC-40
3  CCAFS LC-40
4  CCAFS LC-40

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [13]:
querry = "select SUM(PAYLOAD_MASS__KG_) from SPACEXTBL WHERE Customer = 'NASA (CRS)';"
pd.read_sql_query(querry, con)

   SUM(PAYLOAD_MASS__KG_)
0                   45596

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [14]:
querry = "select AVG(PAYLOAD_MASS__KG_) from SPACEXTBL WHERE Booster_Version = 'F9 v1.1';"
pd.read_sql_query(querry, con)

   AVG(PAYLOAD_MASS__KG_)
0                  2928.4

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [15]:
querry = "select min(Date) from SPACEXTBL WHERE Landing_Outcome=='Success (drone ship)' ;"
pd.read_sql_query(querry, con)

    min(Date)
0  2016-04-08

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [16]:
querry = "select Booster_Version, Landing_Outcome, PAYLOAD_MASS__KG_ from SPACEXTBL WHERE Landing_Outcome=='Success (drone ship)' AND PAYLOAD_MASS__KG_>4000 AND PAYLOAD_MASS__KG_<6000 ;"
pd.read_sql_query(querry, con)

  Booster_Version       Landing_Outcome  PAYLOAD_MASS__KG_
0     F9 FT B1022  Success (drone ship)               4696
1     F9 FT B1026  Success (drone ship)               4600
2  F9 FT  B1021.2  Success (drone ship)               5300
3  F9 FT  B1031.2  Success (drone ship)               5200

### Task 7




##### List the total number of successful and failure mission outcomes

In [17]:
querry = "select COUNT(Mission_Outcome), Mission_Outcome from SPACEXTBL GROUP BY Mission_Outcome;"
pd.read_sql_query(querry, con)

   COUNT(Mission_Outcome)                   Mission_Outcome
0                       1               Failure (in flight)
1                      98                           Success
2                       1                          Success
3                       1  Success (payload status unclear)

### Task 8



##### List all the booster_versions that have carried the maximum payload mass, using a subquery with a suitable aggregate function.

In [25]:
querry = "select Booster_Version, Payload, PAYLOAD_MASS__KG_ from SPACEXTBL WHERE PAYLOAD_MASS__KG_=(select MAX(PAYLOAD_MASS__KG_) from SPACEXTBL);"
pd.read_sql_query(querry, con)

,Booster_Version,Payload,PAYLOAD_MASS__KG_
0,F9 B5 B1048.4,"Starlink 1 v1.0, SpaceX CRS-19",15600
1,F9 B5 B1049.4,"Starlink 2 v1.0, Crew Dragon in-flight abort t...",15600
2,F9 B5 B1051.3,"Starlink 3 v1.0, Starlink 4 v1.0",15600
3,F9 B5 B1056.4,"Starlink 4 v1.0, SpaceX CRS-20",15600
4,F9 B5 B1048.5,"Starlink 5 v1.0, Starlink 6 v1.0",15600
5,F9 B5 B1051.4,"Starlink 6 v1.0, Crew Dragon Demo-2",15600
6,F9 B5 B1049.5,"Starlink 7 v1.0, Starlink 8 v1.0",15600
7,F9 B5 B1060.2,"Starlink 11 v1.0, Starlink 12 v1.0",15600
8,F9 B5 B1058.3,"Starlink 12 v1.0, Starlink 13 v1.0",15600
9,F9 B5 B1051.6,"Starlink 13 v1.0, Starlink 14 v1.0",15600
10,F9 B5 B1060.3,"Starlink 14 v1.0, GPS III-04",15600
11,F9 B5 B1049.7,"Starlink 15 v1.0, SpaceX CRS-21",15600

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

In [22]:
querry = "select substr(Date, 6,2) AS Month, Landing_Outcome, Booster_Version, Launch_Site from SPACEXTBL WHERE substr(Date,0,5)='2015' and Landing_Outcome='Failure (drone ship)';"
pd.read_sql_query(querry, con)

  Month       Landing_Outcome Booster_Version  Launch_Site
0    01  Failure (drone ship)   F9 v1.1 B1012  CCAFS LC-40
1    04  Failure (drone ship)   F9 v1.1 B1015  CCAFS LC-40

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [23]:
querry = "select * from SPACEXTBL WHERE Date>2010-06-04 AND Date<2017-03-02 ORDER BY Landing_Outcome DESC;"
pd.read_sql_query(querry, con)

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing_Outcome
0,2010-06-04,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,2010-12-08,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

<!--
## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2024-07-10 | 1.1 |Anita Verma | Changed Version|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |
-->

## <h3 align="center"> Â© IBM Corporation 2021. All rights reserved. <h3/>

In [57]:
querry = "select min(PAYLOAD_MASS__KG_) from SPACEXTBL;"
pd.read_sql_query(querry, con)

   min(PAYLOAD_MASS__KG_)
0                       0

In [58]:
querry = "select SUM(PAYLOAD_MASS__KG_) as total from SPACEXTBL;"
pd.read_sql_query(querry, con)

    total
0  619967

In [63]:
querry = "select PAYLOAD_MASS__KG_ from SPACEXTBL ORDER BY PAYLOAD_MASS__KG_ ASC LIMIT 1;"
pd.read_sql_query(querry, con)

   PAYLOAD_MASS__KG_
0                  0

In [68]:
querry = "select PAYLOAD_MASS__KG_ from SPACEXTBL WHERE PAYLOAD_MASS__KG_=SELECT MAX(PAYLOAD_MASS__KG_) LIMIT 1;"
pd.read_sql_query(querry, con)

DatabaseError: Execution failed on sql 'select PAYLOAD_MASS__KG_ from SPACEXTBL WHERE PAYLOAD_MASS__KG_=SELECT MAX(PAYLOAD_MASS__KG_) LIMIT 1;': near "SELECT": syntax error